%五阶贝塞尔曲线
%为满足使连接点曲率连续和切线连续,增加了两对控制点
%不成立
clc
clear
close all

%直线段，导数为1
l_x = linspace(-10,0,10000);
l_y = l_x;

%B5曲线控制点，012由直线得出，345由后面的曲线得出
p0=[0,0];
p1=[380/7,15*380/7-760];

p2=[50,-10];
p3=[60,0];

%计算Bezier5曲线
t = 0:0.0001:1;
p11_x = (1-t)*p0(1) + t.*p1(1);
p12_x = (1-t)*p1(1) + t*p2(1);
p13_x = (1-t)*p2(1) + t*p3(1);

p21_x = (1-t).*p11_x + t.*p12_x;
p22_x = (1-t).*p12_x + t.*p13_x;

p31_x = (1-t).*p21_x + t.*p22_x;

p11_y = (1-t)*p0(2) + t.*p1(2);
p12_y = (1-t)*p1(2) + t*p2(2);
p13_y = (1-t)*p2(2) + t*p3(2);
 
p21_y = (1-t).*p11_y + t.*p12_y;
p22_y = (1-t).*p12_y + t.*p13_y;
 
p31_y = (1-t).*p21_y + t.*p22_y;


%B3曲线
p6=[60,0];
p7=[70,10];

p8=[80,15];
p9=[100,30];

%计算Bezier曲线
t = 0:0.0001:1;
p11_x_2 = (1-t)*p6(1) + t.*p7(1);
p12_x_2 = (1-t)*p7(1) + t*p8(1);
p13_x_2 = (1-t)*p8(1) + t*p9(1);

p21_x_2 = (1-t).*p11_x_2 + t.*p12_x_2;
p22_x_2 = (1-t).*p12_x_2 + t.*p13_x_2;

p31_x_2 = (1-t).*p21_x_2 + t.*p22_x_2;

p11_y_2 = (1-t)*p6(2) + t.*p7(2);
p12_y_2 = (1-t)*p7(2) + t*p8(2);
p13_y_2 = (1-t)*p8(2) + t*p9(2);
 
p21_y_2 = (1-t).*p11_y_2 + t.*p12_y_2;
p22_y_2 = (1-t).*p12_y_2 + t.*p13_y_2;
 
p31_y_2 = (1-t).*p21_y_2 + t.*p22_y_2;


subplot(2,2,1)
hold on
%画直线
plot(l_x,l_y,'-')
%画第一个B5前三个控制点
plot([p0(1),p1(1)],[p0(2),p1(2)],'--*')
%画第一个B5
plot(p31_x,p31_y)
%画第一个B5后三个控制点
plot([p2(1),p3(1)],[p2(2),p3(2)],'--*')
%画第二个B5前三个控制点
plot([p6(1),p7(1)],[p6(2),p7(2)],'--*')
%画第二个B5
plot(p31_x_2,p31_y_2)
%画第二个B5后三个控制点
plot([p8(1),p9(1)],[p8(2),p9(2)],'--*')
title('三阶贝塞尔曲线')
p_x = [l_x p31_x p31_x_2];
p_y = [l_y p31_y p31_y_2];
xlim([-15,105])

subplot(2,2,2)
dy = diff(p_y)./diff(p_x);
dy(end+1) = (p9(2)-p8(2))/(p9(1)-p8(1));
plot(p_x,dy)
title('一阶')
xlim([-15,105])


subplot(2,2,3)
ddy = diff(dy)./diff(p_x);
ddy(end+1) = ddy(end);
plot(p_x,ddy,'*','markersize',0.8)
title('二阶')
xlim([-15,105])


subplot(2,2,4)
k = abs(ddy)./(1+dy.^2).^(3/2)
plot(p_x,k,'*','markersize',0.8)
title('曲率')
xlim([-15,105])
