%五阶贝塞尔曲线
%为满足使连接点曲率连续和切线连续,增加了两对控制点

clc
clear
close all

%直线段，导数为1
l_x = linspace(-10,0,10000);
l_y = l_x;

%B5曲线控制点，012由直线得出，345由后面的曲线得出
p0=[0,0];
p1=[10,10];
p2=[10,10];

p6=[60,0];
p7=[70,10];
p8=[80,15];

p5=p6;
p4=p5-p7+p6;
p3=(p8-2*p7+p6)/1-p5+2*p4;
%计算Bezier曲线
t = 0:0.0001:1;
p11_x = (1-t)*p0(1) + t.*p1(1);
p12_x = (1-t)*p1(1) + t*p2(1);
p13_x = (1-t)*p2(1) + t*p3(1);
p14_x = (1-t)*p3(1) + t*p4(1);
p15_x = (1-t)*p4(1) + t*p5(1);

p21_x = (1-t).*p11_x + t.*p12_x;
p22_x = (1-t).*p12_x + t.*p13_x;
p23_x = (1-t).*p13_x + t.*p14_x;
p24_x = (1-t).*p14_x + t.*p15_x;

p31_x = (1-t).*p21_x + t.*p22_x;
p32_x = (1-t).*p22_x + t.*p23_x;
p33_x = (1-t).*p23_x + t.*p24_x;

p41_x = (1-t).*p31_x + t.*p32_x;
p42_x = (1-t).*p32_x + t.*p33_x;

p51_x = (1-t).*p41_x + t.*p42_x;

p11_y = (1-t)*p0(2) + t.*p1(2);
p12_y = (1-t)*p1(2) + t*p2(2);
p13_y = (1-t)*p2(2) + t*p3(2);
p14_y = (1-t)*p3(2) + t*p4(2);
p15_y = (1-t)*p4(2) + t*p5(2);
 
p21_y = (1-t).*p11_y + t.*p12_y;
p22_y = (1-t).*p12_y + t.*p13_y;
p23_y = (1-t).*p13_y + t.*p14_y;
p24_y = (1-t).*p14_y + t.*p15_y;
 
p31_y = (1-t).*p21_y + t.*p22_y;
p32_y = (1-t).*p22_y + t.*p23_y;
p33_y = (1-t).*p23_y + t.*p24_y;
 
p41_y = (1-t).*p31_y + t.*p32_y;
p42_y = (1-t).*p32_y + t.*p33_y;
 
p51_y = (1-t).*p41_y + t.*p42_y;

%B5曲线控制点，012由直线得出，345由后面的曲线得出
p6=[60,0];
p7=[70,10];
p8=[80,15];%此处p8如果不满足在使其二阶导数为0呢？

p9=[110,20];
p10=[120,30];
p11=[140,50];

%计算Bezier曲线
t = 0:0.0001:1;
p11_x_2 = (1-t)*p6(1) + t.*p7(1);
p12_x_2 = (1-t)*p7(1) + t*p8(1);
p13_x_2 = (1-t)*p8(1) + t*p9(1);
p14_x_2 = (1-t)*p9(1) + t*p10(1);
p15_x_2 = (1-t)*p10(1) + t*p11(1);

p21_x_2 = (1-t).*p11_x_2 + t.*p12_x_2;
p22_x_2 = (1-t).*p12_x_2 + t.*p13_x_2;
p23_x_2 = (1-t).*p13_x_2 + t.*p14_x_2;
p24_x_2 = (1-t).*p14_x_2 + t.*p15_x_2;

p31_x_2 = (1-t).*p21_x_2 + t.*p22_x_2;
p32_x_2 = (1-t).*p22_x_2 + t.*p23_x_2;
p33_x_2 = (1-t).*p23_x_2 + t.*p24_x_2;

p41_x_2 = (1-t).*p31_x_2 + t.*p32_x_2;
p42_x_2 = (1-t).*p32_x_2 + t.*p33_x_2;

p51_x_2 = (1-t).*p41_x_2 + t.*p42_x_2;

p11_y_2 = (1-t)*p6(2) + t.*p7(2);
p12_y_2 = (1-t)*p7(2) + t*p8(2);
p13_y_2 = (1-t)*p8(2) + t*p9(2);
p14_y_2 = (1-t)*p9(2) + t*p10(2);
p15_y_2 = (1-t)*p10(2) + t*p11(2);
 
p21_y_2 = (1-t).*p11_y_2 + t.*p12_y_2;
p22_y_2 = (1-t).*p12_y_2 + t.*p13_y_2;
p23_y_2 = (1-t).*p13_y_2 + t.*p14_y_2;
p24_y_2 = (1-t).*p14_y_2 + t.*p15_y_2;
 
p31_y_2 = (1-t).*p21_y_2 + t.*p22_y_2;
p32_y_2 = (1-t).*p22_y_2 + t.*p23_y_2;
p33_y_2 = (1-t).*p23_y_2 + t.*p24_y_2;
 
p41_y_2 = (1-t).*p31_y_2 + t.*p32_y_2;
p42_y_2 = (1-t).*p32_y_2 + t.*p33_y_2;
 
p51_y_2 = (1-t).*p41_y_2 + t.*p42_y_2;



subplot(2,2,1)
hold on
%画直线
plot(l_x,l_y,'k-')
%画第一个B5前三个控制点
plot([p0(1),p1(1),p2(1)],[p0(2),p1(2),p2(2)],'k--*')
%画第一个B5
plot(p51_x,p51_y,'k')
%画第一个B5后三个控制点
plot([p3(1),p4(1),p5(1)],[p3(2),p4(2),p5(2)],'k--*')
%画第二个B5前三个控制点
plot([p6(1),p7(1),p8(1)],[p6(2),p7(2),p8(2)],'k--*')
%画第二个B5
plot(p51_x_2,p51_y_2,'k')
%画第二个B5后三个控制点
plot([p9(1),p10(1),p11(1)],[p9(2),p10(2),p11(2)],'k--*')
%title('直线-5阶-5阶')
p_x = [l_x p51_x p51_x_2];
p_y = [l_y p51_y p51_y_2];
xlim([-15,155])

subplot(2,2,2)
dy = diff(p_y)./diff(p_x);
dy(end+1) = 1;
plot(p_x,dy)
title('一阶')
xlim([-15,155])

subplot(2,2,3)
ddy = diff(dy)./diff(p_x);
ddy(end+1) = 0;
plot(p_x,ddy,'*','markersize',0.8)
title('二阶')
xlim([-15,155])

subplot(2,2,4)
k = ddy./(1+dy.^2).^(3/2)
plot(p_x,k,'*','markersize',0.8)
title('曲率')
xlim([-15,155])